---
kind: type
id: T:Autodesk.Revit.DB.DetachFromCentralOption
source: html/4f5d4de3-7c57-890a-e158-329ae1be884b.htm
---
# Autodesk.Revit.DB.DetachFromCentralOption

Options for workset detachment behavior.

## Syntax (C#)
```csharp
public enum DetachFromCentralOption
```